backend_rails/app/services/owl/gemini_adapter.rb

SELECT "observations".* FROM "observations" WHERE "observations"."fragment_id" = 2 ORDER BY "observations"."created_at" DESC LIMIT 6
---
    def observation_prompt
      user_name = @fragment.user&.username || "Thinker"
      recent_thoughts = @fragment.observations.order(created_at: :asc).last(6).map do |obs|