backend_rails/app/services/owl/growth_synthesizer.rb

    def synthesize_fallback(sparks, _entries)
      sparks_snippets = sparks.map(&:content).join(" ")
      {
        status: "taking_shape",
        headline: "Something may be taking shape",
        reflection: "You have anchored this seed with #{@fragment.observations.where(pinned: true).count} Sparks. There appears to be a gentle tension between holding multiple possibilities open and finding the ground where your commitment feels natural.",
        sparks_count: sparks.count,
        tensions: [
          "Possibility vs. commitment",
          "What is observed vs. what is decided"
        ],
        invitation: "Does this emerging connection feel aligned with what you are trying to understand?"
---
SELECT "observations".* FROM "observations" WHERE "observations"."fragment_id" = 2 AND "observations"."pinned" = TRUE ORDER BY "observations"."created_at" ASC
SELECT COUNT(*) FROM "observations" WHERE "observations"."fragment_id" = 2 AND "observations"."pinned" = TRUE