backend_rails/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username", "fullname", "bio") VALUES ('live@modula.local', '$2a$12$wgp83bVOhFj7ssZjgBYxEujFDKvdfbARWK7QPrw4klNvSz9tm.1Hu', '2026-09-14 04:00:12.804043', '2026-09-14 04:00:12.804043', 'thinker_live', NULL, NULL) RETURNING "id"
---
      def register
        user = User.new(user_params)

        if user.save

SELECT 1 AS one FROM "users" WHERE (lower(username) = 'parikesitad') LIMIT 1
---
      def check_username
        username = params[:username].to_s.strip

        if username.length < 3
          render json: { available: false, message: "Username must be at least 3 characters" }
          return
        end

        exists = User.where("lower(username) = ?", username.downcase).exists?