backend_rails/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username", "fullname", "bio") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def register
        user = User.new(user_params)

        if user.save

SELECT 1 AS one FROM "users" WHERE (lower(username) = $1) LIMIT $2  [[nil, "new_thinker_99"], ["LIMIT", 1]]
---
      def check_username
        username = params[:username].to_s.strip

        if username.length < 3
          render json: { available: false, message: "Username must be at least 3 characters" }
          return
        end

        exists = User.where("lower(username) = ?", username.downcase).exists?