backend_rails/app/controllers/api/v1/fragments_controller.rb

      def index
        fragments = current_user.fragments
                                .includes(:observations)
                                .order(created_at: :desc)

        data = fragments.map do |f|
---
SELECT "fragments".* FROM "fragments" WHERE "fragments"."user_id" = 3 ORDER BY "fragments"."created_at" DESC
SELECT "observations".* FROM "observations" WHERE "observations"."fragment_id" = 3

      def show
        fragment = current_user.fragments.find(params[:id])
---
SELECT "fragments".* FROM "fragments" WHERE "fragments"."user_id" = 3 AND "fragments"."id" = 3 LIMIT 1

      def create
        content = params.require(:fragment).permit(:content)[:content]

        fragment = current_user.fragments.build(content: content)

        if fragment.save
          # The first content is the Seed. Owl quietly observes the initial seed.
          observation_text = Owl::OwlService.new(fragment: fragment).observe
          observation = fragment.observations.create!(
            role: :ai,
            content: observation_text
          )
---
INSERT INTO "fragments" ("content", "created_at", "updated_at", "user_id") VALUES ('Maybe I am not losing focus, maybe I have too many things open.', '2026-09-14 04:00:12.867506', '2026-09-14 04:00:12.867506', 2) RETURNING "id"
INSERT INTO "observations" ("fragment_id", "role", "content", "pinned", "created_at", "updated_at") VALUES (2, 0, 'You seem to be circling around a question that hasn''t fully named itself yet. What would be the honest next question to ask yourself?', NULL, '2026-09-14 04:00:13.307821', '2026-09-14 04:00:13.307821') RETURNING "id"

      def fragment_detail(fragment)
        ordered_obs = fragment.observations.order(created_at: :asc)
        sparks = ordered_obs.select { |o| o.pinned? }
---
SELECT "observations".* FROM "observations" WHERE "observations"."fragment_id" = 2 ORDER BY "observations"."created_at" ASC