backend_rails/app/controllers/api/v1/growth_controller.rb

      def show
        fragment = current_user.fragments.find(params[:fragment_id])
---
SELECT "fragments".* FROM "fragments" WHERE "fragments"."user_id" = 2 AND "fragments"."id" = 2 LIMIT 1