backend_rails/app/controllers/api/v1/sparks_controller.rb

      def pin
        observation = find_user_observation(params[:id])
        observation.update!(pinned: true)
---
UPDATE "observations" SET "pinned" = TRUE, "updated_at" = '2026-09-14 04:00:17.568327' WHERE "observations"."id" = 1

      def find_user_observation(id)
        Observation.joins(:fragment)
                   .where(fragments: { user_id: current_user.id }, observations: { id: id })
                   .first!
---
SELECT "observations".* FROM "observations" INNER JOIN "fragments" ON "fragments"."id" = "observations"."fragment_id" WHERE "fragments"."user_id" = 2 AND "observations"."id" = 1 ORDER BY "observations"."id" ASC LIMIT 1